Revit 2026 API

# FormattedTextGetListStartNumber Method

---

Returns the list start number of the paragraphs in a given text range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetListStartNumber(
	TextRange textRange
)
```
```vb
Public Function GetListStartNumber (
	textRange As TextRange
) As Integer
```
```cpp
public:
int GetListStartNumber(
	TextRange^ textRange
)
```
```fsharp
member GetListStartNumber :
        textRange : TextRange -> int
```

#### Parameters

textRange TextRange
     The given text range.

#### Return Value

Int32 The list start number of the text range.

| Exception | Condition |
| --- | --- |
| ArgumentException | This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| ArgumentNullException | A non-optional argument was null |

Returns -1 if there is a mix of list start values in the range or if there are paragraphs in different lists or sub-lists in the range or if there are paragraphs of type None or Bullet in the range.

#### Reference

FormattedText Class

Autodesk.Revit.DB Namespace